public/phases/Mainnet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-09 Thu 16:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Public Main Net Roadmap</title>
<meta name="author" content="Dowland Aiello" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../theme/rethink.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Public Main Net Roadmap</h1>

<div id="outline-container-org2f935cd" class="outline-2">
<h2 id="org2f935cd"><span class="todo TODO">TODO</span> Public Main Net <code>[0/3]</code></h2>
<div class="outline-text-2" id="text-org2f935cd">
<ul class="org-ul">
<li><i>ETA: Q1 2024</i></li>
</ul>
</div>
<div id="outline-container-orgc0bc8c8" class="outline-3">
<h3 id="orgc0bc8c8"><span class="todo TODO">TODO</span> Code Reviews, Auditing</h3>
<div class="outline-text-3" id="text-orgc0bc8c8">
<p>
Perform internal, and external audits of core Vision components, including all modules developed in-house. Resolve any security concerns prior to release of the public test net, including ones that were uncovered in the prior private testnet. Aim for public transparency with audit results prior to public testnet release.
</p>
</div>
</div>
<div id="outline-container-org0b29a6a" class="outline-3">
<h3 id="org0b29a6a"><span class="todo TODO">TODO</span> Open-Source Codebase</h3>
<div class="outline-text-3" id="text-org0b29a6a">
<p>
Sanitize the Vision codebase for any operations vulnerabilities, and make it publicly accessible within 1 month prior to the Vision public mainnet release. Address any further security vulnerabilities discovered by the community as they arise.
</p>
</div>
</div>
<div id="outline-container-org3b3e0bc" class="outline-3">
<h3 id="org3b3e0bc"><span class="todo TODO">TODO</span> Testnet to Mainnet Migration</h3>
<div class="outline-text-3" id="text-org3b3e0bc">
<p>
Persist user achievements, and basic social data, like friend information, followers, and biographies from the Vision testnet to the Vision mainnet. Allow as much data that was created on the Vision testnet to migrate to the Vision mainnet as possible. <b>Main exclusion:</b> VIS tokens. The distribution of VIS tokens on the Vision mainnet will be completely aligned with the platform's tokenomics document, and will not respect and balances held during the testnet.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 06/22/2022</p>
<p class="author">Author: Dowland Aiello</p>
<p class="date">Created: 2023-02-09 Thu 16:48</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
